app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page])
---
SELECT  `admins`.* FROM `admins` LIMIT 5 OFFSET 0

  def create
    @admin =  Admin.new(params_admin)
    if @admin.save
---
INSERT INTO `admins` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('aldo@id.uff.br', '$2a$04$mnI11WarZFDTPetTAHV6guLLUomKk66aHLaiu1QFD29rMYyD9rHJu', '2019-04-02 18:31:32', '2019-04-02 18:31:32')

  def update
    if @admin.update(params_admin)
---
UPDATE `admins` SET `encrypted_password` = '$2a$04$Yh7zQer/EBWkhBni//Y8h.hXLB2XFVrA6IElppsX/YU/z.ktEG/ai', `updated_at` = '2019-04-02 19:02:05' WHERE `admins`.`id` = 3

  def destroy
    if @admin.destroy
---
DELETE FROM `admins` WHERE `admins`.`id` = 1

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 11 ORDER BY `admins`.`id` ASC LIMIT 1