app/controllers/admins_backoffice/questions_controller.rb

SELECT  `questions`.* FROM `questions` ORDER BY `questions`.`description` ASC LIMIT 25 OFFSET 0
---
  def index
    @questions =
        Question.includes(:subject).order(:description).page(params[:page])

INSERT INTO `questions` (`description`, `subject_id`, `created_at`, `updated_at`) VALUES ('Variável', 2, '2019-04-03 17:43:46', '2019-04-03 17:43:46')
---
  def create
    @question = Question.new(params_question)
    if @question.save

DELETE FROM `questions` WHERE `questions`.`id` = 5
---
  def destroy
    if @question.destroy