app/controllers/admins_backoffice/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects` ORDER BY `subjects`.`description` ASC LIMIT 25 OFFSET 0
---
  def index
    @subjects = Subject.all.order(:description).page(params[:page])

INSERT INTO `subjects` (`description`, `created_at`, `updated_at`) VALUES ('Acionamentos e controles elétricos', '2019-04-03 18:23:20', '2019-04-03 18:23:20')
---
  def create
    @subject = Subject.new(params_subject)
    if @subject.save

UPDATE `subjects` SET `description` = 'Vamos nessa!', `updated_at` = '2019-04-03 19:03:23' WHERE `subjects`.`id` = 3
---
  def update
    if @subject.update(params_subject)

DELETE FROM `subjects` WHERE `subjects`.`id` = 4
---
  def destroy
    if @subject.destroy

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 4 LIMIT 1
---
  def set_subject
    @subject = Subject.find(params[:id])